
******************************************* EXAMPLE SETUP ************************************************

# INITIALIZE BLAZEGRAPH INSTANCE WITH CITATIONS

blazegraph drop
blazegraph import --file ../data/citations.ttl --format ttl

------------------------------------------- SETUP OUTPUTS ------------------------------------------------



******************************************* EXAMPLE S1 ************************************************

# EXPORT CITATIONS AS N-TRIPLES

blazegraph export --format nt | sort

------------------------------------------- S1 OUTPUTS ------------------------------------------------

<http://learningsparql.com/ns/citations#cites> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<http://learningsparql.com/ns/citations#cites> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <http://learningsparql.com/ns/citations#cites> .
<http://learningsparql.com/ns/citations#reports> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<http://learningsparql.com/ns/citations#reports> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <http://learningsparql.com/ns/citations#reports> .
<http://learningsparql.com/ns/citations#uses> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<http://learningsparql.com/ns/citations#uses> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <http://learningsparql.com/ns/citations#uses> .
<http://learningsparql.com/ns/papers#paperA> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperA> <http://purl.org/dc/elements/1.1/title> "Paper A" .
<http://learningsparql.com/ns/papers#paperA> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultB> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperB> <http://purl.org/dc/elements/1.1/title> "Paper B" .
<http://learningsparql.com/ns/papers#paperB> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperC> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperC> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultC> .
<http://learningsparql.com/ns/papers#paperC> <http://purl.org/dc/elements/1.1/title> "Paper C" .
<http://learningsparql.com/ns/papers#paperC> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperB> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD1> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD2> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD3> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultB> .
<http://learningsparql.com/ns/papers#paperD> <http://purl.org/dc/elements/1.1/title> "Paper D" .
<http://learningsparql.com/ns/papers#paperD> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultE> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperE> <http://purl.org/dc/elements/1.1/title> "Paper E" .
<http://learningsparql.com/ns/papers#paperE> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperC> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperE> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultF> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultC> .
<http://learningsparql.com/ns/papers#paperF> <http://purl.org/dc/elements/1.1/title> "Paper F" .
<http://learningsparql.com/ns/papers#paperF> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperC> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperE> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultG1> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultG2> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultE> .
<http://learningsparql.com/ns/papers#paperG> <http://purl.org/dc/elements/1.1/title> "Paper G" .
<http://learningsparql.com/ns/papers#paperG> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperD> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultH> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultD2> .
<http://learningsparql.com/ns/papers#paperH> <http://purl.org/dc/elements/1.1/title> "Paper H" .
<http://learningsparql.com/ns/papers#paperH> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperF> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperG> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultI> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultF> .
<http://learningsparql.com/ns/papers#paperI> <http://purl.org/dc/elements/1.1/title> "Paper I" .
<http://learningsparql.com/ns/papers#paperI> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://purl.org/dc/elements/1.1/title> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<http://purl.org/dc/elements/1.1/title> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <http://purl.org/dc/elements/1.1/title> .


******************************************* EXAMPLE S2 ************************************************

# WHICH PAPERS DIRECTLY CITE WHICH PAPERS?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>

    SELECT DISTINCT ?citing_paper ?cited_paper
    WHERE {
        ?citing_paper c:cites ?cited_paper .
    }
    ORDER BY ?citing_paper ?cited_paper

END_QUERY

------------------------------------------- S2 OUTPUTS ------------------------------------------------

citing_paper                               | cited_paper
=======================================================================================
http://learningsparql.com/ns/papers#paperB | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperC | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperE | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperG


******************************************* EXAMPLE S3 ************************************************

# WHICH PAPERS DEPEND ON WHICH PRIOR WORK?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>

    SELECT DISTINCT ?paper ?prior_work
    WHERE {
        ?paper c:cites+ ?prior_work .
    }
    ORDER BY ?paper ?prior_work

END_QUERY

------------------------------------------- S3 OUTPUTS ------------------------------------------------

paper                                      | prior_work
=======================================================================================
http://learningsparql.com/ns/papers#paperB | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperC | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperE | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperG


******************************************* EXAMPLE S4 ************************************************

# WHICH PAPERS DEPEND ON PAPER A?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites+ :paperA .
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S4 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperG
http://learningsparql.com/ns/papers#paperH
http://learningsparql.com/ns/papers#paperI


******************************************* EXAMPLE S5 ************************************************

# WHICH PAPERS CITE A PAPER THAT CITES PAPER A?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites/c:cites :paperA .
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S5 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperG
http://learningsparql.com/ns/papers#paperH


******************************************* EXAMPLE S6 ************************************************

# WHICH PAPERS CITE A PAPER CITED BY PAPER D?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites/^c:cites :paperD .
        FILTER(?paper != :paperD)
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S6 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperE


******************************************* EXAMPLE S7 ************************************************

# WHAT RESULTS DEPEND DIRECTLY ON RESULTS REPORTED BY PAPER A?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?result
    WHERE {
        :paperA c:reports/^c:uses/c:reports ?result
    }
    ORDER BY ?result

END_QUERY

------------------------------------------- S7 OUTPUTS ------------------------------------------------

result
==========================================
http://learningsparql.com/ns/papers#resultB
http://learningsparql.com/ns/papers#resultE


******************************************* EXAMPLE S7 ************************************************

# WHAT RESULTS DEPEND DIRECTLY OR INDIRECTLY ON RESULTS REPORTED BY PAPER A?

blazegraph select --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?result
    WHERE {
        :paperA c:reports/(^c:uses/c:reports)+ ?result
    }
    ORDER BY ?result

END_QUERY

------------------------------------------- S7 OUTPUTS ------------------------------------------------

result
===========================================
http://learningsparql.com/ns/papers#resultB
http://learningsparql.com/ns/papers#resultD1
http://learningsparql.com/ns/papers#resultD2
http://learningsparql.com/ns/papers#resultD3
http://learningsparql.com/ns/papers#resultE
http://learningsparql.com/ns/papers#resultG1
http://learningsparql.com/ns/papers#resultG2
http://learningsparql.com/ns/papers#resultH


******************************************* EXAMPLE S8 ************************************************

# Visualization of Citation Graph

blazegraph report << '__END_REPORT_TEMPLATE__'

    {{{
        {{ include "graphviz.g" }}
    }}}

    {{ prefix "dc" "http://purl.org/dc/elements/1.1/" }}
    {{ prefix "c" "http://learningsparql.com/ns/citations#" }}

    {{ gv_graph "wt_run" }}

    {{ gv_title "Citation Graph" }}
    
    {{ gv_cluster "citations" }}

    # paper nodes
    {{ range $Paper := select '''
        SELECT ?paper ?title
        WHERE {
            ?paper rdf:type c:Paper .
            ?paper dc:title ?title .
        } ''' | rows }}                                             \
        {{ gv_labeled_node (index $Paper 0) (index $Paper 1) }}
    {{ end }}
                                                                    \
    # citation edges
    {{ range $Citation := select '''
            SELECT DISTINCT ?citing_paper ?cited_paper
            WHERE {
                ?citing_paper c:cites ?cited_paper .
            }
            ORDER BY ?citing_paper ?cited_paper        
        ''' | rows }}                                                \
        {{ gv_edge (index $Citation 0) (index $Citation 1) }}
    {{ end }}
                                                                    \
    {{ gv_cluster_end }}
    
    {{ gv_end }}

__END_REPORT_TEMPLATE__

----------------------------------------- S8 DOT OUTPUT -----------------------------------------------

digraph wt_run {
rankdir=BT

fontname=Courier; fontsize=18; labelloc=t
label="Citation Graph"

subgraph cluster_citations { label=""; color=white; penwidth=0
subgraph cluster_citations_inner { label=""; color=white

# paper nodes
"http://learningsparql.com/ns/papers#paperA" [label="Paper A"]
"http://learningsparql.com/ns/papers#paperB" [label="Paper B"]
"http://learningsparql.com/ns/papers#paperC" [label="Paper C"]
"http://learningsparql.com/ns/papers#paperD" [label="Paper D"]
"http://learningsparql.com/ns/papers#paperE" [label="Paper E"]
"http://learningsparql.com/ns/papers#paperF" [label="Paper F"]
"http://learningsparql.com/ns/papers#paperG" [label="Paper G"]
"http://learningsparql.com/ns/papers#paperH" [label="Paper H"]
"http://learningsparql.com/ns/papers#paperI" [label="Paper I"]

# citation edges
"http://learningsparql.com/ns/papers#paperB" -> "http://learningsparql.com/ns/papers#paperA"
"http://learningsparql.com/ns/papers#paperC" -> "http://learningsparql.com/ns/papers#paperA"
"http://learningsparql.com/ns/papers#paperD" -> "http://learningsparql.com/ns/papers#paperA"
"http://learningsparql.com/ns/papers#paperD" -> "http://learningsparql.com/ns/papers#paperB"
"http://learningsparql.com/ns/papers#paperE" -> "http://learningsparql.com/ns/papers#paperA"
"http://learningsparql.com/ns/papers#paperF" -> "http://learningsparql.com/ns/papers#paperC"
"http://learningsparql.com/ns/papers#paperF" -> "http://learningsparql.com/ns/papers#paperE"
"http://learningsparql.com/ns/papers#paperG" -> "http://learningsparql.com/ns/papers#paperC"
"http://learningsparql.com/ns/papers#paperG" -> "http://learningsparql.com/ns/papers#paperE"
"http://learningsparql.com/ns/papers#paperH" -> "http://learningsparql.com/ns/papers#paperD"
"http://learningsparql.com/ns/papers#paperI" -> "http://learningsparql.com/ns/papers#paperF"
"http://learningsparql.com/ns/papers#paperI" -> "http://learningsparql.com/ns/papers#paperG"

}}

}
